In [9]:
import numpy as np  
import pandas as pd
import random as rd

mydict = {'X': [rd.randint(60, 100) for i in range(5)],
          'Y': [rd.randint(60, 100) for i in range(5)],
          'Z': [rd.randint(60, 100) for i in range(5)]}
df = pd.DataFrame(mydict)
df

    X   Y    Z
0  99  75   95
1  99  70  100
2  68  84   99
3  98  99   95
4  64  79   65

In [10]:
yn = ['yes', 'no']
df2 = pd.DataFrame({
    'name': ['A', 'B', 'C', 'D', 'E', 'F', 'G'],
    'score': [float(rd.randint(0, 40)) / 2 for i in range(7)],
    'attempts': [rd.randint(1, 3) for i in range(7)],
    'qualify': [rd.choice(yn) for i in range(7)]  
})

df2

  name  score  attempts qualify
0    A   11.5         3     yes
1    B    5.0         2      no
2    C    8.0         1      no
3    D   15.0         1      no
4    E    8.0         1     yes
5    F    9.5         2     yes
6    G    1.5         2     yes

In [11]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      7 non-null      object
 1   score     7 non-null      float64
 2   attempts  7 non-null      int64
 3   qualify   7 non-null      object
dtypes: float64(1), int64(1), object(2)
memory usage: 356.0+ bytes

In [12]:
df2.describe()

           score  attempts
count   7.000000  7.000000
mean    8.357143  1.714286
std     4.356167  0.755929
min     1.500000  1.000000
25%     6.500000  1.000000
50%     8.000000  2.000000
75%    10.500000  2.000000
max    15.000000  3.000000

In [13]:
#NaN
df2.iloc[1,1] = df2.iloc[2,1] = np.nan
df2

  name  score  attempts qualify
0    A   11.5         3     yes
1    B    NaN         2      no
2    C    NaN         1      no
3    D   15.0         1      no
4    E    8.0         1     yes
5    F    9.5         2     yes
6    G    1.5         2     yes

In [14]:
#iv
count = 0
for k,v in df2.items():
    count += v.isna().sum()
    
df2.isnull().values.sum()
count

2

In [15]:
df2.isnull().sum()

name        0
score       2
attempts    0
qualify     0
dtype: int64

In [66]:
df2.fillna(0, inplace=True)
df2

  name  score  attempts qualify
0    A   20.0         3      no
1    B    0.0         3      no
2    C    0.0         2      no
3    D   15.0         2     yes

In [80]:
df2.reset_index(level=0, inplace=True)
df2

   index name  score  attempts qualify
0      0    A    8.0         3      no
1      1    B   14.5         1      no
2      2    C    0.5         2     yes
3      3    D    5.5         3      no
4      4    E    3.5         3      no
5      5    F    1.0         3     yes
6      6    G    0.5         2     yes

In [76]:
df2.to_string(index=False)
df2

  name  score  attempts qualify
0    A    8.0         3      no
1    B   14.5         1      no
2    C    0.5         2     yes
3    D    5.5         3      no
4    E    3.5         3      no
5    F    1.0         3     yes
6    G    0.5         2     yes

In [ ]:
#Đếm số lượng hàng, số lượng cột.
print(f"So luong hang: {len(df2.axes[0])}, So luong cot: {len(df2.axes[1])}")

So luong hang: 7, So luong cot: 4

In [81]:
'''- Lấy danh sách tên các cột của df2 DataFrame đưa vào 1 array. Thực hiện lại tương tự
nhưng đưa danh sách vào 1 list.'''
arr = df2.columns.values
print(arr)
list1 = list(df2.columns.values)
print(list1)

['index' 'name' 'score' 'attempts' 'qualify']
['index', 'name', 'score', 'attempts', 'qualify']

In [ ]:
'''Dựa trên iterrows của đối tượng DataFrame, duyệt qua từng hàng và in dữ liệu ra
màn hình giá trị trên 3 cột: index, name, score'''
for index, row in df2.iterrows():
    print(row["index"], row["name"], row["score"])

0 A 8.0
1 B 14.5
2 C 0.5
3 D 5.5
4 E 3.5
5 F 1.0
6 G 0.5

In [93]:
'''Hiển thị dữ liệu của hàng thứ 5.
'''
print(df2.iloc[5])

index         5
name          F
score         1
attempts      3
qualify     yes
Name: 5, dtype: object

In [94]:
'''Hiển thị 3 hàng đầu tiên của dữ liệu.
'''
df2.iloc[:3]

   index name  score  attempts qualify
0      0    A    8.0         3      no
1      1    B   14.5         1      no
2      2    C    0.5         2     yes

In [95]:
'''Chỉ cho hiển thị cột name và score .'''
df2[['name', 'score']]

  name  score
0    A    8.0
1    B   14.5
2    C    0.5
3    D    5.5
4    E    3.5
5    F    1.0
6    G    0.5

In [118]:
'''Kết hợp câu d và câu e để có kết quả gồm 3 hàng và 2 cột.
'''
df2[:3][['name', 'score']]

  name  score
0    A    8.0
1  NaN   14.5
2  NaN    0.5

In [123]:
'''Chọn ra những hàng mà dữ liệu bị thiếu (NaN) trên cột score.'''
#print([df2.iloc[i] for i in range(len(df2)) if df2.iloc[i].isnull().any()])
df2[df2['name'].isnull()]

   index name  score  attempts qualify
1      1  NaN   14.5         1      no
2      2  NaN    0.5         2     yes

In [124]:
'''Chỉ cho hiển thị các hàng có attemps>2.
'''
df2[df2['attempts'] > 2]

   index name  score  attempts qualify
0      0    A    8.0         3      no
3      3    D    5.5         3      no
4      4    E    3.5         3      no
5      5    F    1.0         3     yes

In [126]:
'''Chọn ra những hàng mà giá trị trên cột score nằm trong khoảng tứ 15 đến 20'''
df2[(df2['score'] >= 15) & (df2['score'] <= 20)]

Empty DataFrame
Columns: [index, name, score, attempts, qualify]
Index: []

In [16]:
df2[df2['score'].between(15, 20)]

  name  score  attempts qualify
3    D   15.0         1      no

In [17]:
'''Chọn ra những hàng mà giá trị trên cột score <12 hoặc >=15.'''
df2[(df2['score'] < 12) | (df2['score'] >= 15)]

  name  score  attempts qualify
0    A   11.5         3     yes
3    D   15.0         1      no
4    E    8.0         1     yes
5    F    9.5         2     yes
6    G    1.5         2     yes

In [18]:
'''Chọn các hàng có số attempts nhỏ hơn 2 và có score lớn hơn 15.'''
df2[(df2['attempts'] < 2) & (df2['score'] > 15)]

Empty DataFrame
Columns: [name, score, attempts, qualify]
Index: []

In [19]:
'''Chọn ra những hàng có score>=18 (với đầy đủ các cột). Sau đó chỉ cho hiện nội dung
của 2 cột name và score.
'''
df2[df2['score'] >= 18][['name', 'score']]

Empty DataFrame
Columns: [name, score]
Index: []

In [141]:
'''Sử dụng thuộc tính loc để sửa giá trị của hàng có chỉ mục 4 là trên cột score thành
11.5'''
df2.loc[4, 'score'] = 11.5

df2

   index name  score  attempts qualify
0      0    A    8.0         3      no
1      1  NaN   14.5         1      no
2      2  NaN    0.5         2     yes
3      3    D    5.5         3      no
4      4    E   11.5         3      no
5      5    F    1.0         3     yes
6      6    G    0.5         2     yes

In [146]:
'''Thay giá trị trên cột qualify từ yes thành True và từ no thành False.'''
df2['qualify'] = df2['qualify'].map({'yes': True, 'no': False})
df2

   index name  score  attempts  qualify
0      0    A    8.0         3    False
1      1  NaN   14.5         1    False
2      2  NaN    0.5         2     True
3      3    D    5.5         3    False
4      4    E   11.5         3    False
5      5    F    1.0         3     True
6      6    G    0.5         2     True

In [148]:
'''Thay tên ‘Sửu’ trong cột name thành tên ‘Hợi’'''
df2['name'] = df2['name'].replace('A', 'B')
df2

   index name  score  attempts  qualify
0      0    B    8.0         3    False
1      1  NaN   14.5         1    False
2      2  NaN    0.5         2     True
3      3    D    5.5         3    False
4      4    E   11.5         3    False
5      5    F    1.0         3     True
6      6    G    0.5         2     True

In [150]:
'''Sắp xếp dữ liệu giảm dần theo name và tăng dần theo score'''
df2=df2.sort_values(by=['name', 'score'], ascending=[False,True])
df2

   index name  score  attempts  qualify
6      6    G    0.5         2     True
5      5    F    1.0         3     True
4      4    E   11.5         3    False
3      3    D    5.5         3    False
0      0    B    8.0         3    False
2      2  NaN    0.5         2     True
1      1  NaN   14.5         1    False

In [152]:
'''Sử dụng thuộc tính loc để thêm 1 dòng mới với index là k, các dữ liệu khác trên dòng
là tùy ý. Kiểm tra kết quả thực hiện.'''
df2.loc[len(df2.axes[0])] = ['k', 'H', 15, 3, True]
df2

  index name  score  attempts  qualify
6     6    G    0.5         2     True
5     5    F    1.0         3     True
4     4    E   11.5         3    False
3     3    D    5.5         3    False
0     0    B    8.0         3    False
2     2  NaN    0.5         2     True
1     1  NaN   14.5         1    False
7     k    H   15.0         3     True
8     k    H   15.0         3     True

In [153]:
'''Xóa dòng vừa thêm ở câu trước. Như vậy dữ liệu lúc này tương tự như dữ liệu ban đầu.'''
df2=df2.drop(8)

In [154]:
df2

  index name  score  attempts  qualify
6     6    G    0.5         2     True
5     5    F    1.0         3     True
4     4    E   11.5         3    False
3     3    D    5.5         3    False
0     0    B    8.0         3    False
2     2  NaN    0.5         2     True
1     1  NaN   14.5         1    False
7     k    H   15.0         3     True

In [156]:
'''Sử dụng phương thức concat của pandas để thêm 1 dòng mới với name=’Hợi’,
score=16.0, attempts=1, qualify=yes với index =0 vào df2.'''
D = {'index': 'h', 'name': 'Hợi', 'score': 16.0, 'attempts': 1, 'qualify': True}
df3 = pd.DataFrame(D, index=[8])
df2 = pd.concat([df2, df3], ignore_index=True)

In [157]:
df2

  index name  score  attempts  qualify
0     6    G    0.5         2     True
1     5    F    1.0         3     True
2     4    E   11.5         3    False
3     3    D    5.5         3    False
4     0    B    8.0         3    False
5     2  NaN    0.5         2     True
6     1  NaN   14.5         1    False
7     k    H   15.0         3     True
8     h  Hợi   16.0         1     True

In [158]:
'''Đổi vị trí 2 cột score và attempts cho nhau.
'''
df2 = df2[['index', 'name', 'attempts', 'score', 'qualify']]

In [159]:
df2

  index name  attempts  score  qualify
0     6    G         2    0.5     True
1     5    F         3    1.0     True
2     4    E         3   11.5    False
3     3    D         3    5.5    False
4     0    B         3    8.0    False
5     2  NaN         2    0.5     True
6     1  NaN         1   14.5    False
7     k    H         3   15.0     True
8     h  Hợi         1   16.0     True

In [160]:
'''Đổi tên các cột theo thứ tự trái sang phải là: Tên, Điểm, Số lần thi, Đủ điều kiện.
Kiểm tra kết quả thực hiện. Nếu đã đúng, thay lại tên cũ cho các cột của df2.'''
df2 = df2.rename(columns={'name': 'Ten', 'score': 'Diem', 'attempts': 'SoLanThi', 'qualify': 'DuDieuKien'})

In [161]:
df2

  index  Ten  SoLanThi  Diem  DuDieuKien
0     6    G         2   0.5        True
1     5    F         3   1.0        True
2     4    E         3  11.5       False
3     3    D         3   5.5       False
4     0    B         3   8.0       False
5     2  NaN         2   0.5        True
6     1  NaN         1  14.5       False
7     k    H         3  15.0        True
8     h  Hợi         1  16.0        True

In [162]:
'''Xóa cột 'qualify' khỏi df2'''
df2 = df2.pop('DuDieuKien')
df2

0     True
1     True
2    False
3    False
4    False
5     True
6    False
7     True
8     True
Name: DuDieuKien, dtype: bool

In [166]:
'''Nội dung df2 DataFrame vào file DataFrame2.csv. Sau đó đọc dữ liệu từ file để đưa
vào 1 DataFrame mới (df2_new) rồi in DataFrame này ra màn hình.
'''
df2_new = df2.to_csv('E:/DataFrame2.csv')
df2_new = pd.read_csv('E:/DataFrame2.csv')
df2_new

   Unnamed: 0 name  score  attempts qualify
0           0    A   20.0         2      no
1           1    B   19.5         1      no
2           2    C   19.0         2     yes
3           3    D   20.0         2     yes
4           4    E    9.5         1     yes
5           5    F    6.0         3      no
6           6    G    5.5         2     yes

In [8]:
'''Nối 2 data series vào 1 DataFrame'''
S1 = pd.Series([1, 2, 3, 4, 5, 6, 7])
S2 = pd.Series([23, 12, 9, 4])
df4 = pd.concat([S1, S2], axis=1)

In [9]:
df4

   0     1
0  1  23.0
1  2  12.0
2  3   9.0
3  4   4.0
4  5   NaN
5  6   NaN
6  7   NaN

In [5]:
S11 = pd.Series([1, 2, 3, 4, 5, 6, 7])
S21 = pd.Series([23, 12, 9, 4])
df5 = pd.concat([S11, S21], axis=0)
df5

0     1
1     2
2     3
3     4
4     5
5     6
6     7
0    23
1    12
2     9
3     4
dtype: int64

In [11]:
df6 = pd.read_csv('E:\Data Analysis Basic Method\Project\Data-Analysis-Basic-Method\Document\Retail_Transactions_Dataset.csv')
df6

,Transaction_ID,Date,Customer_Name,Product,Total_Items,Total_Cost,Payment_Method,City,Store_Type,Discount_Applied,Customer_Category,Season,Promotion
0,1000000000,2022-01-21 06:27:29,Stacey Price,"['Ketchup', 'Shaving Cream', 'Light Bulbs']",3,71.65,Mobile Payment,Los Angeles,Warehouse Club,True,Homemaker,Winter,None
1,1000000001,2023-03-01 13:01:21,Michelle Carlson,"['Ice Cream', 'Milk', 'Olive Oil', 'Bread', 'P...",2,25.93,Cash,San Francisco,Specialty Store,True,Professional,Fall,BOGO (Buy One Get One)
2,1000000002,2024-03-21 15:37:04,Lisa Graves,['Spinach'],6,41.49,Credit Card,Houston,Department Store,True,Professional,Winter,None
3,1000000003,2020-10-31 09:59:47,Mrs. Patricia May,"['Tissues', 'Mustard']",1,39.34,Mobile Payment,Chicago,Pharmacy,True,Homemaker,Spring,None
4,1000000004,2020-12-10 00:59:59,Susan Mitchell,['Dish Soap'],10,16.42,Debit Card,Houston,Specialty Store,False,Young Adult,Winter,Discount on Selected Items
5,1000000005,2021-10-07 12:37:26,Joshua Frazier,"['Toothpaste', 'Chicken']",3,72.24,Cash,Houston,Supermarket,True,Retiree,Spring,Discount on Selected Items
6,1000000006,2023-01-08 10:40:03,Victoria Garrett,"['Honey', 'BBQ Sauce', 'Soda', 'Olive Oil', 'G...",4,5.28,Cash,Boston,Specialty Store,False,Student,Summer,Discount on Selected Items
7,1000000007,2020-09-03 12:39:59,Sydney Waller,"['Syrup', 'Trash Cans', 'Pancake Mix', 'Water'...",5,21.77,Debit Card,Chicago,Specialty Store,False,Young Adult,Winter,Discount on Selected Items
8,1000000008,2021-04-05 06:32:18,Kimberly Morgan,['Insect Repellent'],4,55.25,Mobile Payment,Los Angeles,Warehouse Club,False,Homemaker,Fall,None
9,1000000009,2021-07-08 10:08:59,Lori Conway,"['Soap', 'Baby Wipes', 'Soda']",7,31.21,Mobile Payment,Boston,Convenience Store,True,Young Adult,Winter,None
10,1000000010,2020-03-18 18:58:18,Randall Roberts,"['Extension Cords', 'Soda', 'Water', 'Garden H...",8,91.59,Debit Card,Boston,Department Store,True,Middle-Aged,Fall,BOGO (Buy One Get One)
11,1000000011,2023-03-30 19:26:41,Jeremiah White,"['Tea', 'Paper Towels', 'Spinach']",7,31.88,Mobile Payment,New York,Specialty Store,False,Young Adult,Fall,Discount on Selected Items
12,1000000012,2023-05-27 15:52:59,Sheila Mcgee,"['Salmon', 'Shaving Cream']",9,39.75,Debit Card,New York,Pharmacy,False,Student,Summer,Discount on Selected Items
13,1000000013,2023-04-02 09:24:11,Allen Miles,"['Trash Bags', 'Apple', 'Mop', 'Hair Gel']",7,17.51,Mobile Payment,Seattle,Warehouse Club,False,Retiree,Winter,BOGO (Buy One Get One)
14,1000000014,2020-04-09 04:31:05,Mark Howard,"['Razors', 'Laundry Detergent', 'Beef']",1,33.64,Credit Card,San Francisco,Warehouse Club,True,Retiree,Spring,None
15,1000000015,2021-01-01 04:29:07,Jesse Henderson,"['Cereal', 'Vinegar', 'Bath Towels']",7,29.57,Mobile Payment,San Francisco,Convenience Store,False,Retiree,Winter,BOGO (Buy One Get One)
16,1000000016,2021-10-15 13:24:31,Eric Wall,"['Air Freshener', 'Feminine Hygiene Products']",5,99.70,Mobile Payment,Miami,Specialty Store,True,Homemaker,Spring,None
17,1000000017,2021-09-16 09:28:28,Vanessa Peck,"['Power Strips', 'Honey', 'Ketchup', 'Tea', 'S...",8,15.62,Credit Card,San Francisco,Department Store,False,Senior Citizen,Fall,None
18,1000000018,2022-07-18 11:33:28,Dominique Stout,"['Mustard', 'Dustpan']",3,98.28,Mobile Payment,New York,Warehouse Club,False,Professional,Fall,BOGO (Buy One Get One)
19,1000000019,2021-01-31 07:52:18,Charles Brooks,['Coffee'],7,96.77,Debit Card,Chicago,Department Store,True,Homemaker,Winter,Discount on Selected Items
20,1000000020,2021-10-31 07:46:22,Angela Jones,"['Pancake Mix', 'Vacuum Cleaner']",7,83.86,Cash,Houston,Pharmacy,False,Teenager,Winter,Discount on Selected Items
21,1000000021,2022-12-30 20:03:19,John Roberts,"['Coffee', 'Shaving Cream']",1,39.93,Credit Card,Miami,Department Store,False,Retiree,Summer,BOGO (Buy One Get One)
22,1000000022,2021-06-08 10:28:59,Nicole White,"['Shrimp', 'Iron', 'Cleaning Spray', 'Toilet P...",4,35.62,Mobile Payment,New York,Warehouse Club,True,Retiree,Spring,BOGO (Buy One Get One)
23,1000000023,2020-01-03 23:24:18,Don Harris,"['Dishware', 'Pickles']",7,19.56,Cash,San Francisco,Department Store,False,Retiree,Spring,BOGO (Buy One Get One)
24,1000000024,2023-02-27 16:46:56,Hannah Rowland,"['Sponges', 'Vacuum Cleaner', 'Iron']",4,24.03,Debit Card,Dallas,Pharmacy,False,Student,Winter,None
25,1000000025,2020-02-14 13:19:10,Jessica Gonzalez,"['Broom', 'Cereal']",10,7.82,Credit Card,New York,Convenience Store,False,Professional,Fall,BOGO (Buy One Get One)
26,1000000026,2020-09-21 10:34:40,Christina Smith,"['Garden Hose', 'Trash Cans']",6,49.45,Debit Card,Dallas,Warehouse Club,False,Senior Citizen,Winter,Discount on Selected Items
27,1000000027,2020-03-26 22:08:34,Latoya Allen,"['Ketchup', 'Trash Cans', 'Toothbrush']",10,29.36,Mobile Payment,Boston,Specialty Store,False,Professional,Spring,None
28,1000000028,2022-08-13 01:26:19,Clayton Roth,"['Tomatoes', 'Salmon']",7,21.08,Credit Card,San Francisco,Specialty Store,True,Teenager,Fall,None
29,1000000029,2020-02-27 10:23:56,Dennis Alvarez,"['Tea', 'Salmon', 'Bath Towels', 'Toothpaste']",7,75.38,Mobile Payment,Houston,Convenience Store,True,Teenager,Summer,Discount on Selected Items
...,...,...,...,...,...,...,...,...,...,...,...,...,...
999970,1000999970,2022-12-22 20:45:30,Raymond Blankenship,"['Salmon', 'Olive Oil']",4,49.22,Cash,Boston,Convenience Store,False,Senior Citizen,Winter,None
999971,1000999971,2024-04-21 13:38:05,Jeffrey Herrera,"['Ketchup', 'Tissues', 'Broom']",4,59.70,Debit Card,Atlanta,Specialty Store,True,Young Adult,Winter,None
999972,1000999972,2020-05-24 19:16:30,William Brown,['Shaving Cream'],8,32.64,Credit Card,Houston,Specialty Store,False,Teenager,Fall,Discount on Selected Items
999973,1000999973,2023-05-23 10:26:04,Taylor Martin,['Feminine Hygiene Products'],8,56.52,Cash,Los Angeles,Specialty Store,False,Homemaker,Fall,BOGO (Buy One Get One)
999974,1000999974,2023-04-28 13:27:16,Michelle Kim,"['Shampoo', 'Power Strips']",5,81.60,Debit Card,Los Angeles,Convenience Store,False,Homemaker,Spring,Discount on Selected Items
999975,1000999975,2021-12-02 19:14:20,Stephen Griffin,"['Potatoes', 'Vinegar', 'Hair Gel', 'Chips']",7,30.77,Mobile Payment,Los Angeles,Convenience Store,False,Young Adult,Winter,None
999976,1000999976,2021-06-25 16:31:55,Joshua Green,"['Jam', 'Apple']",2,68.97,Cash,Seattle,Department Store,True,Young Adult,Summer,BOGO (Buy One Get One)
999977,1000999977,2023-10-05 09:53:09,Robin Waters,"['Tuna', 'Orange', 'Ketchup']",8,87.59,Mobile Payment,Los Angeles,Supermarket,True,Student,Summer,BOGO (Buy One Get One)
999978,1000999978,2022-04-23 05:27:26,Cristina Torres,"['Soda', 'Paper Towels', 'Carrots', 'Cheese', ...",9,75.85,Credit Card,Atlanta,Convenience Store,False,Senior Citizen,Winter,None
999979,1000999979,2022-09-21 12:33:09,Joseph Lindsey,"['Dishware', 'Canned Soup']",4,17.02,Mobile Payment,Atlanta,Department Store,True,Homemaker,Winter,BOGO (Buy One Get One)
999980,1000999980,2022-09-06 17:57:37,Melissa Thomas,"['Toothbrush', 'Honey', 'Dustpan', 'Syrup', 'G...",4,16.49,Debit Card,Boston,Convenience Store,False,Homemaker,Summer,Discount on Selected Items
999981,1000999981,2022-05-28 01:00:48,Carla Gonzalez,['Potatoes'],1,81.14,Mobile Payment,Los Angeles,Department Store,False,Middle-Aged,Fall,None
999982,1000999982,2023-02-12 02:16:32,Leslie Sanford,['Trash Cans'],4,66.85,Cash,Miami,Pharmacy,True,Middle-Aged,Summer,BOGO (Buy One Get One)
999983,1000999983,2023-10-02 22:34:12,Mr. James Buchanan,"['Paper Towels', 'Tomatoes']",2,74.41,Credit Card,Atlanta,Warehouse Club,False,Student,Spring,BOGO (Buy One Get One)
999984,1000999984,2022-01-25 08:22:29,Gary Mosley,"['Trash Cans', 'Apple']",3,71.41,Cash,Chicago,Convenience Store,False,Retiree,Summer,None
999985,1000999985,2020-01-06 22:31:47,Gary Salas,"['Soda', 'Milk', 'Baby Wipes', 'Vacuum Cleaner...",3,20.84,Debit Card,Houston,Pharmacy,False,Middle-Aged,Summer,None
999986,1000999986,2020-08-24 22:32:04,Angela Campbell,"['Light Bulbs', 'Trash Cans', 'Power Strips', ...",8,66.81,Debit Card,San Francisco,Supermarket,False,Senior Citizen,Summer,None
999987,1000999987,2020-07-23 10:27:00,Shaun Wilkerson,"['Pancake Mix', 'Pasta']",9,85.92,Mobile Payment,New York,Warehouse Club,True,Young Adult,Summer,Discount on Selected Items
999988,1000999988,2023-06-08 01:04:43,Blake Richard,"['Chips', 'Razors', 'Tea', 'Tomatoes']",9,94.09,Mobile Payment,Atlanta,Convenience Store,False,Student,Summer,BOGO (Buy One Get One)
999989,1000999989,2020-09-30 04:13:03,Bonnie Hughes,"['Trash Bags', 'Mayonnaise', 'Soda']",8,49.01,Debit Card,Miami,Department Store,False,Retiree,Summer,None
999990,1000999990,2020-03-18 19:54:23,Krista Miller,"['Jam', 'Light Bulbs', 'Mayonnaise']",10,96.19,Credit Card,Los Angeles,Supermarket,False,Retiree,Fall,BOGO (Buy One Get One)
999991,1000999991,2021-08-30 04:16:07,Jamie Nunez,"['Jam', 'Cleaning Spray', 'Cereal']",8,28.07,Mobile Payment,Los Angeles,Department Store,False,Retiree,Winter,None
999992,1000999992,2023-05-09 02:22:44,Gabrielle Nelson,"['Laundry Detergent', 'Razors', 'Insect Repell...",7,89.26,Credit Card,Seattle,Pharmacy,False,Homemaker,Spring,None
999993,1000999993,2022-01-02 19:40:32,Donna Hamilton,"['Laundry Detergent', 'Feminine Hygiene Produc...",6,65.29,Debit Card,Dallas,Specialty Store,True,Student,Summer,BOGO (Buy One Get One)
999994,1000999994,2021-03-13 14:12:17,James Villegas,"['Toothbrush', 'Hair Gel', 'Milk']",8,99.12,Cash,Los Angeles,Supermarket,False,Retiree,Summer,BOGO (Buy One Get One)
999995,1000999995,2023-03-27 06:12:10,Lisa Gonzalez,"['Pickles', 'Carrots', 'Peanut Butter', 'Spong...",1,22.07,Debit Card,Los Angeles,Supermarket,False,Middle-Aged,Winter,None
999996,1000999996,2022-05-19 05:13:58,Emily Graham,['Cereal'],8,80.25,Cash,Houston,Warehouse Club,True,Senior Citizen,Spring,Discount on Selected Items
999997,1000999997,2021-09-03 13:59:39,Cynthia Anderson,['Trash Bags'],3,60.74,Credit Card,Los Angeles,Convenience Store,False,Homemaker,Winter,None
999998,1000999998,2023-10-17 05:50:40,Michael Rodriguez,"['Diapers', 'Coffee', 'Coffee', 'Mop']",3,23.48,Debit Card,San Francisco,Supermarket,True,Retiree,Winter,BOGO (Buy One Get One)
999999,1000999999,2020-06-15 11:58:49,Jennifer Davis,"['Trash Cans', 'Mop', 'Jam']",8,44.12,Credit Card,Atlanta,Pharmacy,False,Professional,Fall,Discount on Selected Items